init.org
#+title: My Emacs Configuration
#+options: ^:{} html-postamble:nil
#+property: header-args :mkdirp yes :tangle yes :tangle-mode: #o444 :results silent :noweb yes
#+archive: archives/%s::datetree/
#+startup: indent
* An Explanation
This is a literate configuration for =Emacs=.
Tangling this file creates an Elisp file, =~/.emacs.d/lisp/init.el=.
* Bootstrapping
** pre-early-init
:PROPERTIES:
:header-args: :tangle-mode o444 :results silent :tangle ~/.emacs.d/pre-early-init.el
:END:
Emacs 27.0 introduced an early-init file. It allows customization before package and UI initialization.

#+begin_src emacs-lisp :lexical t
    ;;; pre-early-init.el --- Emacs pre package.el & GUI configuration -*- no-byte-compile: t; lexical-binding: t; -*-
    ;;; Code:

;;; Misc
(setq custom-file null-device)
(setq minimal-emacs-gc-cons-threshold (* 64 1024 1024 1024))

(setq inhibit-default-init nil)
(setq server-client-instructions nil)
(setq desktop-restore-forces-onscreen nil)
(setq ring-bell-function #'ignore)

(prefer-coding-system 'utf-8)
(set-default-coding-systems 'utf-8)
(set-selection-coding-system 'utf-8)
(set-language-environment "UTF-8")
(set-charset-priority 'unicode)
(setq default-process-coding-system '(utf-8-unix . utf-8-unix))


;; Set-language-environment sets default-input-method, which is unwanted.
(setq default-input-method nil)


(provide 'pre-early-init)
  ;;; pre-early-init.el ends here

#+end_src

