init.org
** post-init
:PROPERTIES:
:header-args: :tangle-mode o444 :results silent :tangle ~/.emacs.d/post-init.el
:END:
Emacs 27.0 introduced an early-init file. It allows customization before package and UI initialization.

#+begin_src emacs-lisp :lexical t
    ;;; post-init.el --- Emacs pre package.el & GUI configuration -*- no-byte-compile: t; lexical-binding: t; -*-
    ;;; Code:

(require 'vc-git)
(which-key-mode)
;; (setq initial-buffer-choice t) ;;*scratch*

(keymap-global-set "H-r" 'revert-buffer)
(keymap-global-set "H-l" 'scroll-lock-mode)
(keymap-global-set "C-x e" 'eshell)
(keymap-global-set "C-x C-;" 'comment-line)
(keymap-global-set "C-H-<up>" 'scroll-other-window-down)
(keymap-global-set "C-H-<down>" 'scroll-other-window)


(put 'upcase-region 'disabled nil)
(put 'downcase-region 'disabled nil)

(setq mark-ring-max 10)
(setq global-mark-ring-max 10)

(setq mouse-wheel-scroll-amount '(1 ((shift) . 1))) ;; one line at a time
(setq mouse-wheel-progressive-speed nil) ;; don't accelerate scrolling
(setq mouse-wheel-follow-mouse t) ;; scroll window under mouse
(global-unset-key (kbd "C-<wheel-up>")) ;; disable scrolling to zoom
(global-unset-key (kbd "C-<wheel-down>"))



(global-display-line-numbers-mode t)
(show-paren-mode 1)

(setq-default indent-tabs-mode nil)
(setq-default tab-width 4)

(setq font-lock-maximum-decoration 4)


(defun connect-focusvq-home ()
  (interactive)
  (dired "/rpc:sfigueroa@dev.focusvq.com:/home/sfigueroa/"))

(setq sql-connection-alist
      '(
        (mysql-fds (sql-product 'mysql)
                   (sql-port 0)
                   (sql-server "db.internal.focusvq.com")
                   (sql-user "fds")
                   (sql-password "WnJSuqmND9i0ePYw")
                   (sql-database "fds"))

        (mysql-elcano (sql-product 'mysql)
                      (sql-port 0)
                      (sql-server "db.internal.focusvq.com")
                      (sql-user "fds")
                      (sql-password "WnJSuqmND9i0ePYw")
                      (sql-database "elcano"))
       
      (mysql-deploy (sql-product 'mysql)
                      (sql-port 0)
                      (sql-server "db.internal.focusvq.com")
                      (sql-user "fds")
                      (sql-password "WnJSuqmND9i0ePYw")
                      (sql-database "fvq_account_manager"))
        )
      )

(keymap-global-set "H-c h" 'connect-focusvq-home)


;;; recolor ansi

(defun ansi-color-on-buffer ()
  "..."
  (interactive)

  (replace-string-in-region "[43m" "[45m" (point-min) (point-max) ) ;; replace yellow highlights
  (replace-string-in-region ";43m" ";45m" (point-min) (point-max) )
  (replace-string-in-region "[34m" "[33m" (point-min) (point-max) ) ;; replace blue text
  (replace-string-in-region ";34m" ";33m" (point-min) (point-max) )
  (ansi-color-apply-on-region (point-min) (point-max)))

;;;This is for when I accidentally make a column in org mode

(defun set-region-writeable (begin end)
  "Removes the read-only text property from the marked region."
  ;; See http://stackoverflow.com/questions/7410125
  (interactive "r")
  (let ((modified (buffer-modified-p))
        (inhibit-read-only t))
    (remove-text-properties begin end '(read-only t))
    (set-buffer-modified-p modified)))

(provide 'post-init)
  ;;; post-init.el ends here

#+end_src

* Init File
** Core Emacs & UI
*** Basic Emacs Customizations
#+begin_src emacs-lisp :lexical t

;;; init.el --- Init -*- no-byte-compile: t; lexical-binding: t; -*-
(minimal-emacs-load-user-init "pre-init.el")

(use-feature eldoc
  :defer t
  :init
  (setq custom-delayed-init-variables '())
  :config
  (global-eldoc-mode))

(use-feature seq
  :defer t
  :init
  (setq custom-delayed-init-variables '()))

(use-package delight
  :defer t)

(use-feature emacs
  :init
  ;; Allow for shorter responses: "y" for yes and "n" for no.
  (if (boundp 'use-short-answers)
      (setq use-short-answers t)
    (advice-add #'yes-or-no-p :override #'y-or-n-p))
  (defalias #'view-hello-file #'ignore))
#+end_src

*** GC & Performance
#+begin_src emacs-lisp :lexical t :tangle yes
(use-package gcmh
  :delight
  :commands gcmh-mode
  :hook (emacs-startup . gcmh-mode)
  :init
  (setq gcmh-idle-delay 5
        gcmh-high-cons-threshold (* 64 1024 1024 1024)))

(use-feature emacs
  :init
  ;; Prefer loading newer compiled files
  (setq load-prefer-newer t)

  ;; Increase how much is read from processes in a single chunk (default is 4kb).
  (setq read-process-output-max (* 512 1024))  ; 512kb

  ;; Reduce rendering/line scan work by not rendering cursors or regions in
  ;; non-focused windows.
  (setq-default cursor-in-non-selected-windows nil)
  (setq highlight-nonselected-windows nil)

  ;; Disable warnings from the legacy advice API. They aren't useful.
  (setq ad-redefinition-action 'accept)

  (setq warning-suppress-types '((lexical-binding)))

  ;; Don't ping things that look like domain names.
  (setq ffap-machine-p-known 'reject)

  ;; By default, Emacs "updates" its ui more often than it needs to
  (setq idle-update-delay 1.0)

  ;; Font compacting can be very resource-intensive, especially when rendering
  ;; icon fonts on Windows. This will increase memory usage.
  (setq inhibit-compacting-font-caches t))
#+end_src

*** UI Elements
#+begin_src emacs-lisp :lexical t
(use-package transient
  :defer t)

(use-feature emacs
  :init
  (setq frame-title-format minimal-emacs-frame-title-format
        icon-title-format minimal-emacs-frame-title-format)

  ;; Disable startup screens and messages
  (setq inhibit-splash-screen t)

  (unless (memq 'menu-bar minimal-emacs-ui-features)
    (push '(menu-bar-lines . 0) default-frame-alist)
    (unless (memq window-system '(mac ns))
      (setq menu-bar-mode nil)))

  (unless (memq 'tool-bar minimal-emacs-ui-features)
    (push '(tool-bar-lines . 0) default-frame-alist)
    (setq tool-bar-mode nil))

  (push '(vertical-scroll-bars) default-frame-alist)
  (push '(horizontal-scroll-bars) default-frame-alist)
  (setq scroll-bar-mode nil)
  (when (fboundp 'horizontal-scroll-bar-mode)
    (horizontal-scroll-bar-mode -1))

  (unless (memq 'tooltips minimal-emacs-ui-features)
    (when (bound-and-true-p tooltip-mode)
      (tooltip-mode -1)))

  (unless (memq 'dialogs minimal-emacs-ui-features)
    (setq use-file-dialog nil)
    (setq use-dialog-box nil)))
#+end_src

*** Theme & Font
#+begin_src emacs-lisp :lexical t :tangle yes

(use-package color-theme-sanityinc-tomorrow
  :defer nil
  :init
  (setq custom-safe-themes t)   ; Treat all themes as safe
  :config
  (setq global-hl-line-modes '(not vterm-mode))
  (global-hl-line-mode 1)
  ;; (set-face-attribute 'hl-line nil :inherit nil :background "gray90")
  
  (add-to-list 'default-frame-alist
               '(font . "Hack-12")) 
  (tool-bar-mode -1)
  (menu-bar-mode -1)
  (color-theme-sanityinc-tomorrow-night)
  )
#+end_src

*** macOS Specific
#+begin_src emacs-lisp :lexical t
(when (memq window-system '(mac ns))
  (setq mac-option-modifier 'hyper ;; for emacs-mac
        mac-command-modifier 'meta
        mac-right-option-modifier 'super)
  (setq ns-command-modifier 'meta ;; for emacs-plus
        ns-option-modifier 'hyper
        ns-right-option-modifier 'super)
  
  (if (file-exists-p "/opt/homebrew/bin/brew")
      (let ((my-paths '("/opt/homebrew/bin" 
                        "/opt/homebrew/sbin" 
                        "/usr/local/bin" 
                        "/usr/bin" 
                        "/bin" 
                        "/usr/sbin" 
                        "/sbin")))
        (setenv "PATH" (string-join my-paths ":"))
        (setq exec-path (append my-paths (list exec-directory))))
    ;; Fallback to exec-path-from-shell
    (use-package exec-path-from-shell
      :ensure t
      :config
      (setq exec-path-from-shell-arguments '("-l"))
      (setq exec-path-from-shell-variables '("PATH"))
      (exec-path-from-shell-initialize))))
#+end_src

*** Indentation
#+begin_src emacs-lisp :lexical t
(use-feature emacs
  :init
  (setq-default indent-tabs-mode nil)
  (setq-default tab-width 4)
  (setq font-lock-maximum-decoration 4))
#+end_src

** Completion Framework
*** Corfu
#+begin_src emacs-lisp :lexical t :tangle yes

(use-package corfu
  :ensure t
  :defer t
  :delight t
  :hook (emacs-startup . global-corfu-mode)
  :bind* (("C-<tab>" . completion-at-point))
  :custom
  (corfu-cycle t)                ;; Enable cycling for `corfu-next/previous'
  (corfu-auto t)                 ;; Enable auto completion
  (corfu-auto-delay 0.5)         ;; Delay for auto-completion (snappy but TRAMP-safe)
  (corfu-auto-prefix 2)          ;; Require 2 characters before auto-completion
  (corfu-separator ?\s)          ;; Orderless field separator
  (corfu-quit-at-boundary nil)   ;; Never quit at completion boundary
  (corfu-quit-no-match t)        ;; Never quit, even if there is no match
  (corfu-preview-current nil)    ;; Disable current candidate preview
  (corfu-preselect 'prompt)      ;; Preselect the prompt
  (corfu-on-exact-match nil)     ;; Configure handling of exact matches
  (corfu-scroll-margin 5)        ;; Use scroll margin

  :custom-face
  (corfu-border (
                 (((class color) (background light)) (:background "gold"))
                 (((class color) (background dark))  (:background "gold"))
                 ))
  )

(use-package corfu-popupinfo
  :ensure nil
  :after corfu
  :hook (corfu-mode . corfu-popupinfo-mode)
  :custom
  (corfu-popupinfo-delay '(0.5 . 0.2))
  (corfu-popupinfo-hide nil)
  :bind (:map corfu-map
              ("H-p" . corfu-popupinfo-scroll-down)
              ("H-n" . corfu-popupinfo-scroll-up)
              ("H-<tab>" . corfu-popupinfo-toggle)))
#+end_src

*** Vertico
#+begin_src emacs-lisp :lexical t :tangle yes

(use-package vertico
  :ensure t
  ;; :defer t
  :delight t
  :hook (emacs-startup . vertico-mode)
  :bind (:map vertico-map
          ("M-S" . my-vertico-cycle-sort))
  :config
  (vertico-mode 1)
  (setq vertico-cycle nil)
  (setq vertico-resize nil)
  (setq enable-recursive-minibuffers t)
  (setq read-extended-command-predicate #'command-completion-default-include-p)
  (setq minibuffer-prompt-properties
        '(read-only t cursor-intangible t face minibuffer-prompt))

  (defvar my-vertico-sort-methods '(nil vertico-sort-alpha vertico-sort-length-alpha))
  (defvar-local my-vertico-sort-index 0)

  (defun my-vertico-cycle-sort ()
    "Cycle through different Vertico sorting methods."
    (interactive)
    (setq my-vertico-sort-index
          (mod (1+ my-vertico-sort-index) (length my-vertico-sort-methods)))
    (setq-local vertico-sort-override-function
                (nth my-vertico-sort-index my-vertico-sort-methods))
    (message "Vertico sort: %s" (or vertico-sort-override-function "Default"))
    (setq vertico--input t))
  )
;; (use-package vertico-directory
;;   :after vertico
;;   :ensure nil
;;   ;; More convenient directory navigation commands
;;   :bind (:map vertico-map
;;               ("RET" . vertico-directory-enter)
;;               ("DEL" . vertico-directory-delete-char)
;;               ("M-DEL" . vertico-directory-delete-word))
;;   ;; Tidy shadowed file names (e.g. ~/foo/bar//baz -> /baz)
;;   :hook (rfn-eshadow-update-overlay . vertico-directory-tidy))
#+end_src

*** Orderless
#+begin_src emacs-lisp :lexical t :tangle yes
(use-package orderless
  :ensure t
  :delight t
  :custom
  (completion-styles '(orderless basic))
  (completion-category-overrides '((file (styles . (partial-completion substring)))))
  (completion-pcm-leading-wildcard t)
  (orderless-style-dispatchers '(my-orderless-dispatch))
  :init
  (defun my-orderless-dispatch (pattern index _total)
    (cond
     ;; Ensure that $ works with Consult commands, which add disambiguation suffixes
     ((string-suffix-p "$" pattern)
      `(orderless-regexp . ,(concat (substring pattern 0 -1) "[\x100000-\x10FFFD]*$")))
     ;; Ignore character (!)
     ((string-prefix-p "!" pattern)
      `(orderless-without-literal . ,(substring pattern 1))))))
#+end_src

*** Consult
#+begin_src emacs-lisp :lexical t :tangle yes
(use-package consult
  :ensure t
  :defer t
  :delight t
  :bind* (
          ("C-x b" . consult-buffer)
          ("M-y" . consult-yank-pop)
          ("M-g M-g" . consult-goto-line)
          ("C-c C-SPC" . consult-mark)
          ("M-g i" . consult-imenu)
          ("C-x C-a" . consult-grep)
          ("C-x f" . consult-recent-file)
          ("H-s" . consult-ripgrep)
          ("M-g f" . consult-flymake)
          )

  :config
  ;; Use a debounce delay for preview to avoid severe lag over TRAMP
  (setq consult-preview-key (list :debounce 0.01 'any))
  (setq consult-narrow-key "<")
  (setq consult-line-start-from-top nil)
  )

;; (use-package consult-dir
;;   :ensure t
;;   :defer t
;;   :bind (("C-x C-d" . consult-dir)
;;          :map vertico-map
;;          ("C-x C-d" . consult-dir)
;;          ("C-x C-j" . consult-dir-jump-file)))


(use-package embark-consult
  :ensure t
  :defer t)

(use-package wgrep
  :ensure t
  :defer t
  :custom
  (wgrep-auto-save-buffer t))
#+end_src

